Documents/урскПереносЕдиницОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>урскПереносЕдиницОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскЕдиницыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтароеТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/урскЕдиницыОборудованияНаТехническихМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>урскЕдиницыОборудованияНаТехническихМестах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницыОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскЕдиницыОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.урскВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/урскПереносЕдиницОборудования/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)  
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата + 1;
	Движение.ЕдиницыОборудования = ЕдиницаОборудования;
	Движение.ТехническоеМесто = НовоеТехническоеМесто;   
	
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата ;
	Движение.ЕдиницыОборудования = " ";
	Движение.ТехническоеМесто = СтароеТехническоеМесто; 
КонецПроцедуры
 #КонецОбласти
